tangyangguang/Esp32Base/examples/web_ui_gallery/src/main.cpp
#include <Arduino.h>
#include <Esp32Base.h>
#include <WiFi.h>

#ifndef ESP32BASE_WEB_UI_GALLERY_SELFTEST
#define ESP32BASE_WEB_UI_GALLERY_SELFTEST 0
#endif

const Esp32BaseWeb::ResultNotice GALLERY_RESULTS[] = {
    {"saved", "1", Esp32BaseWeb::UI_OK, "保存成功", "页面已通过 POST -> 303 -> GET 返回。"},
    {"done", "1", Esp32BaseWeb::UI_OK, "操作已提交", "这是一次性命令的完成反馈。"},
    {"blocked", "1", Esp32BaseWeb::UI_WARN, "暂不能执行", "设备状态不满足条件时，应说明原因和下一步。"}
};

static const char* GALLERY_NS = "ui_gallery";
static const char* GALLERY_KEY_TITLE = "title";
static const char* GALLERY_KEY_INTERVAL = "interval";
static const char* GALLERY_KEY_READONLY = "readonly";

#if ESP32BASE_WEB_UI_GALLERY_SELFTEST
static bool g_selfTestDone = false;

size_t advanceMatch(const char* pattern, size_t patternLen, size_t matched, char c) {
    while (matched > 0 && c != pattern[matched]) {
        size_t next = matched - 1;
        while (next > 0 && strncmp(pattern, pattern + matched - next, next) != 0) {
            --next;
        }
        matched = next;
    }
    if (c == pattern[matched]) {
        ++matched;
        if (matched > patternLen) {
            matched = patternLen;
        }
    }
    return matched;
}

bool selfTestRequest(const char* method, const char* path, const char* body, bool auth, int expectedCode,
                     const char* mustContain, const char* mustNotContain = nullptr, bool ajax = false,
                     const char* origin = nullptr) {
    WiFiClient client;
    const IPAddress targetIp = Esp32BaseWiFi::state() == Esp32BaseWiFi::CONFIG_PORTAL ? WiFi.softAPIP() : WiFi.localIP();
    if (!client.connect(targetIp, 80)) {
        ESP32BASE_LOG_E("selftest", "%s %s connect_failed", method, path);
        return false;
    }
    client.print(method);
    client.print(" ");
    client.print(path);
    client.print(" HTTP/1.1\r\nHost: ");
    client.print(targetIp);
    client.print("\r\nConnection: close\r\n");
    if (auth) {
        client.print("Authorization: Basic YWRtaW46YWRtaW4=\r\n");
    }
    if (origin) {
        client.print("Origin: ");
        client.print(origin);
        client.print("\r\n");
    }
    if (ajax) {
        client.print("X-Esp32Base-Ajax: 1\r\nAccept: application/json\r\n");
    }
    const size_t bodyLen = body ? strlen(body) : 0;
    if (bodyLen > 0) {
        client.print("Content-Type: application/x-www-form-urlencoded\r\nContent-Length: ");
        client.print(bodyLen);
        client.print("\r\n");
    }
    client.print("\r\n");
    if (bodyLen > 0) {
        client.print(body);
    }

    char statusLine[96];
    size_t statusUsed = 0;
    size_t matchUsed = 0;
    const size_t matchLen = mustContain ? strlen(mustContain) : 0;
    const size_t forbidLen = mustNotContain ? strlen(mustNotContain) : 0;
    bool contains = !mustContain || matchLen == 0;
    bool forbidden = false;
    bool firstLineDone = false;
    size_t forbidUsed = 0;
    const uint32_t startMs = millis();
    while ((millis() - startMs) < 5000UL && (client.connected() || client.available())) {
        while (client.available()) {
            const char c = static_cast<char>(client.read());
            if (!firstLineDone) {
                if (c == '\n') {
                    firstLineDone = true;
                } else if (c != '\r' && statusUsed + 1 < sizeof(statusLine)) {
                    statusLine[statusUsed++] = c;
                }
            }
            if (!contains && mustContain) {
                matchUsed = advanceMatch(mustContain, matchLen, matchUsed, c);
                if (matchUsed == matchLen) {
                    contains = true;
                }
            }
            if (!forbidden && mustNotContain) {
                forbidUsed = advanceMatch(mustNotContain, forbidLen, forbidUsed, c);
                if (forbidUsed == forbidLen) {
                    forbidden = true;
                }
            }
        }
        Esp32Base::handle();
        delay(1);
    }
    statusLine[statusUsed] = '\0';
    client.stop();

    int code = 0;
    sscanf(statusLine, "HTTP/%*s %d", &code);
    const bool ok = code == expectedCode && contains && !forbidden;
    ESP32BASE_LOG_I("selftest", "%s %s code=%d expected=%d contains=%s excludes=%s result=%s",
                    method, path, code, expectedCode, mustContain ? mustContain : "-",
                    mustNotContain ? mustNotContain : "-",
                    ok ? "pass" : "fail");
    return ok;
}

void runSelfTest() {
    static uint32_t lastWaitLogMs = 0;
    if (g_selfTestDone) {
        return;
    }
    if (!Esp32BaseWeb::isReady()) {
        const uint32_t now = millis();
        if (now - lastWaitLogMs > 5000UL) {
            lastWaitLogMs = now;
            ESP32BASE_LOG_I("selftest", "waiting wifi=%s web=%s state=%s",
                            Esp32BaseWiFi::isConnected() ? "yes" : "no",
                            Esp32BaseWeb::isReady() ? "yes" : "no",
                            Esp32BaseWiFi::stateName());
        }
        return;
    }
    g_selfTestDone = true;
    uint8_t pass = 0;
    uint8_t total = 0;
#define RUN_SELFTEST(method, path, body, auth, code, contains, ...) \
    do { ++total; if (selfTestRequest(method, path, body, auth, code, contains, ##__VA_ARGS__)) ++pass; } while (0)
#define RUN_AJAX_SELFTEST(method, path, body, auth, code, contains) \
    do { ++total; if (selfTestRequest(method, path, body, auth, code, contains, nullptr, true)) ++pass; } while (0)
#define RUN_CROSS_ORIGIN_SELFTEST(method, path, body, auth, code, contains) \
    do { ++total; if (selfTestRequest(method, path, body, auth, code, contains, nullptr, false, "http://evil.example")) ++pass; } while (0)
    RUN_SELFTEST("GET", "/", nullptr, true, 302, "Location: /index");
    RUN_SELFTEST("GET", "/index", nullptr, true, 200, "状态概览");
    RUN_SELFTEST("GET", "/ui-status", nullptr, true, 200, "状态概览");
    RUN_SELFTEST("GET", "/ui-status/stats", nullptr, true, 200, "统计摘要");
    RUN_SELFTEST("GET", "/ui-records?page=2", nullptr, true, 200, "共 128 条 / 13 页");
    RUN_SELFTEST("GET", "/ui-records?page=2", nullptr, true, 200, "range=24h&amp;type=all&amp;per=10&amp;page=1");
    RUN_SELFTEST("GET", "/ui-records?page=2", nullptr, true, 200, "<link rel='stylesheet' href='/esp32base/ui.css", ":root{color-scheme");
    RUN_SELFTEST("GET", "/esp32base/ui.css", nullptr, true, 200, "Cache-Control: public, max-age=86400");
    RUN_SELFTEST("GET", "/esp32base/ui.css", nullptr, true, 200, "--eb-primary-hover");
    RUN_SELFTEST("GET", "/esp32base/ui.css", nullptr, true, 200, ".tablewrap");
    RUN_SELFTEST("GET", "/esp32base/ui.css", nullptr, true, 200, ".statusgrid");
    RUN_SELFTEST("GET", "/esp32base/ui.css", nullptr, true, 200, ".btnlink,input.btnlink");
    RUN_SELFTEST("GET", "/esp32base/ui.css", nullptr, true, 200, ".eb-dialog{");
    RUN_SELFTEST("GET", "/esp32base/ui.css", nullptr, true, 200, ".eb-inline-edit{");
    RUN_SELFTEST("GET", "/ui-records?page=2", nullptr, true, 200, "aria-current='page'>2</span>", "当前第");
    RUN_SELFTEST("GET", "/ui-records?range=24h&type=all&per=10&page=2", nullptr, true, 200, "filterbar", "name='start'");
    RUN_SELFTEST("GET", "/ui-records?range=custom&type=all&start=2026-05-28T08:00&end=2026-05-28T09:00", nullptr, true, 200, "name='start'");
    RUN_SELFTEST("GET", "/ui-records?range=30d&type=guard&page=4", nullptr, true, 200, "aria-current='page'>4</span>");
    RUN_SELFTEST("GET", "/ui-records?range=30d&type=guard&page=4", nullptr, true, 200, "filterbar", "每页 10 条");
    RUN_SELFTEST("GET", "/ui-config?saved=1", nullptr, true, 200, "保存成功");
    RUN_SELFTEST("GET", "/ui-config", nullptr, true, 200, "data-eb-inline-edit");
    RUN_SELFTEST("GET", "/ui-config", nullptr, true, 200, "data-eb-dialog");
    RUN_SELFTEST("GET", "/ui-config", nullptr, true, 200, "<dialog id='native-confirm' class='panel eb-modal'>");
    RUN_SELFTEST("GET", "/ui-config", nullptr, true, 200, "id='row-plan'");
    RUN_CROSS_ORIGIN_SELFTEST("POST", "/ui-config/name", "name=blocked", true, 403, "Forbidden");
    RUN_SELFTEST("POST", "/ui-config/name", "name=flower", true, 303, "Location: /ui-config?saved=1");
    RUN_AJAX_SELFTEST("POST", "/ui-config/name", "name=flower", true, 200, "\"ok\":true");
    RUN_AJAX_SELFTEST("POST", "/ui-config/name", "name=", true, 400, "\"ok\":false");
    RUN_AJAX_SELFTEST("POST", "/ui-config/dialog", "limit=42&mode=manual", true, 200, "\"ok\":true");
    RUN_SELFTEST("GET", "/ui-action", nullptr, true, 200, "操作命令");
    RUN_SELFTEST("GET", "/ui-action", nullptr, true, 200, "<input type='submit' class='btnlink info' value='开始'>");
    RUN_CROSS_ORIGIN_SELFTEST("POST", "/ui-action/run", "run=1", true, 403, "Forbidden");
    RUN_SELFTEST("POST", "/ui-action/run", "run=1", true, 303, "Location: /ui-action?done=1");
    RUN_SELFTEST("GET", "/ui-config/flow?saved=1", nullptr, true, 200, "流程向导");
    RUN_SELFTEST("GET", "/ui-status/maintenance", nullptr, true, 200, "诊断维护");
    RUN_SELFTEST("GET", "/ui-status/maintenance", nullptr, true, 200, "class='uactions readonly'><span class='uvalue'>正常</span>");
    RUN_SELFTEST("GET", "/ui-status/maintenance", nullptr, true, 200, "class='uactions'><span class='uvalue'>空闲</span><a class='btnlink info' href='/esp32base/tools'>查看</a>");
    RUN_SELFTEST("GET", "/ui-status/access", nullptr, false, 200, "访问控制");
    RUN_SELFTEST("GET", "/ui-config/confirm", nullptr, true, 200, "确认保护");
    RUN_SELFTEST("POST", "/ui-confirm/run", "confirm=1", true, 303, "Location: /ui-config/confirm?done=1");
    RUN_SELFTEST("GET", "/ui-records/empty", nullptr, true, 200, "空状态");
    RUN_SELFTEST("GET", "/ui-form", nullptr, true, 200, "多字段表单");
    RUN_SELFTEST("GET", "/ui-form", nullptr, true, 200, "fieldgrid");
    RUN_SELFTEST("POST", "/ui-form/save", "name=gallery&limit=30", true, 303, "Location: /ui-form?saved=1");
    RUN_SELFTEST("GET", "/esp32base/app-config", nullptr, true, 200, "Device title");
    RUN_SELFTEST("GET", "/esp32base/logs", nullptr, true, 200, "System logs unavailable");
    RUN_SELFTEST("GET", "/esp32base/logs?error=unavailable", nullptr, true, 200, "System logs action failed");
    RUN_SELFTEST("GET", "/ui-status", nullptr, true, 200, "<footer class='footerbar'><span class='syslinks'><a href='/esp32base'>Status</a><a href='/esp32base/logs'>System Logs</a><a href='/esp32base/app-config'>App Config</a>");
#undef RUN_SELFTEST
#undef RUN_AJAX_SELFTEST
#undef RUN_CROSS_ORIGIN_SELFTEST
    ESP32BASE_LOG_I("selftest", "summary pass=%u total=%u", static_cast<unsigned>(pass), static_cast<unsigned>(total));
}
#endif

void handleHeadExtra() {
    Esp32BaseWeb::sendChunk("<style id='gallery-head-extra'>.swatch{display:inline-flex;gap:6px;align-items:center}.swatch i{display:inline-block;width:18px;height:18px;border-radius:5px;border:1px solid var(--eb-line)}.inlineedit{border:1px solid #b9e3d9;background:#f3fbf8;border-radius:8px;padding:10px;margin:0 0 10px}.inlineedit form{display:grid;grid-template-columns:1fr auto auto;gap:8px;align-items:end}.inlineedit input{margin:0}@media(max-width:760px){.inlineedit form{grid-template-columns:1fr}.inlineedit .actions{margin-top:0}}</style>");
}

